In [1]:
%matplotlib inline
import pandas as pd
#import seaborn as sns
#import datetime
import matplotlib.pyplot as plt
import matplotlib.ticker as mtick
pd.options.display.max_rows = 10
#sns.set(context='notebook', rc={'figure.figsize': (8, 5)})

In [2]:
!curl https://covid.ourworldindata.org/data/who/full_data.csv >> data/full_data.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100 80069  100 80069    0     0   232k      0 --:--:-- --:--:-- --:--:--  233k

In [3]:
df = pd.read_csv('data/full_data.csv', parse_dates=[0])
df

            date     location new_cases new_deaths total_cases total_deaths
0     2020-02-25  Afghanistan       NaN        NaN           1          NaN
1     2020-02-26  Afghanistan         0        NaN           1          NaN
2     2020-02-27  Afghanistan         0        NaN           1          NaN
3     2020-02-28  Afghanistan         0        NaN           1          NaN
4     2020-02-29  Afghanistan         0        NaN           1          NaN
...          ...          ...       ...        ...         ...          ...
8598  2020-03-13        World      7488        338      132758         4956
8599  2020-03-14        World      9761        433      142534         5392
8600  2020-03-15        World     10967        343      153517         5735
8601  2020-03-16        World     13971        855      167506         6606
8602  2020-03-17        World     11594        819      179112         7426

[8603 rows x 6 columns]

In [4]:
# Select rows where location is Italy
italy_df = df[df['location'] == 'Italy']
italy_df

            date location new_cases new_deaths total_cases total_deaths
1264  2020-01-31    Italy       NaN        NaN           2          NaN
1265  2020-02-01    Italy         0        NaN           2          NaN
1266  2020-02-02    Italy         0        NaN           2          NaN
1267  2020-02-03    Italy         0        NaN           2          NaN
1268  2020-02-04    Italy         0        NaN           2          NaN
...          ...      ...       ...        ...         ...          ...
7042  2020-03-13    Italy      2651        189       15113         1016
7043  2020-03-14    Italy      2547        252       17660         1268
7044  2020-03-15    Italy      3497        173       21157         1441
7045  2020-03-16    Italy      3590        368       24747         1809
7046  2020-03-17    Italy      3233        694       27980         2503

[141 rows x 6 columns]

In [16]:
italy_df_cases_vs_deaths = italy_df[['total_cases', 'total_deaths']]
italy_df_cases_vs_deaths = italy_df_cases_vs_deaths.fillna(0)
italy_df_cases_vs_deaths
#italy_df_cases_vs_deaths.plot()
#plt.show()

     total_cases total_deaths
1264           2            0
1265           2            0
1266           2            0
1267           2            0
1268           2            0
...          ...          ...
7042       15113         1016
7043       17660         1268
7044       21157         1441
7045       24747         1809
7046       27980         2503

[141 rows x 2 columns]